# Editors
brew "helix"
brew "neovim"

# Shell + completions
brew "nushell"
brew "carapace"

# Version control
brew "gh"
brew "git-delta"
brew "jj"
brew "lazygit"

# File / search utilities
brew "bat"
brew "eza"
brew "fd"
brew "fzf"
brew "tree"
brew "zoxide"
brew "glow"

# Language toolchains
brew "go"
brew "nvm"
brew "poetry"

# LSPs / formatters / linters
brew "bash-language-server"
brew "dprint"
brew "marksman"
brew "shellcheck"
brew "shfmt"
brew "taplo"
brew "yaml-language-server"
brew "zls"

# Env management
brew "direnv"

# Apps
cask "bruno"
cask "secretive"
